###### Linux,Unix
mkdir -p /foo/bar ディレクトリ無ければ掘る

###### mac
⌘ + w 今のウィンドウを閉じる
\ option + ¥

##### iTerm2
⌘ + d 同ウィンドウ内でタブ分割
⌘ + t 新たなタブで開く

##### chrome
⌘ + option + カーソルキー タブ移動する
⌘ + w 現在のタブを閉じる
⌘ + t 新しいタブを開く
F12 検証ペインを開く

##### vim
gg ファイルの先頭に移動する
G ファイルの最後に移動する
H 画面上(Home)
M 中央(Middle)
L 最後(Last)
sp 画面を上下分割(side横)
vs 画面を左右分割(virtical縦)
shift + j 前の行と連結
g + shift + j 前の行とスペースなし連結
ctrl + v 矩形選択
ctrl + [ コマンドモードに戻る
w 単語送り→
b ←単語戻り
0 行頭に移動(キャレット^ も同じふるまい)
$ 行末に移動
% 対応するカッコに移動
x 一文字削除する
A 行末に移動してインサートモード
d$ カーソルの位置から行末まで削除する
2dw カーソルの位置から2単語削除
U 行全体のundo
%s/置換前/置換後/gc ひとつずつ確認しながら置換する
!外部コマンド 外部コマンドを実行する


⌘ + 
⌘ + 

⌘⌘⌘⌘⌘⌘⌘⌘⌘⌘⌘⌘⌘⌘⌘⌘⌘⌘⌘⌘⌘⌘⌘⌘⌘⌘⌘⌘⌘
